<script setup>
import HeaderVue from "./components/HeaderVue.vue";
</script>

<template>
  <div class="container">
    <HeaderVue />

    <main class="main">
      <section class="intro">
        <h1 class="intro__title">
          Автоматическая фильтрация КТ ОГК — экономьте время рентгенолога
        </h1>
        <p class="intro__text">
          Определение исследований без признаков патологии с высокой точностью.
          Поддержка загрузки ZIP с DICOM, экспорт отчётов (.xlsx) и визуализация
          масок.
        </p>
        <div class="intro__example">
          <div class="intro__example-col">
            <img class="intro__img op-20" src="../public/example.jpg" alt="" />
            <img class="intro__img op-40" src="../public/example.jpg" alt="" />
            <img class="intro__img op-70" src="../public/example.jpg" alt="" />
            <img class="intro__img" src="../public/example.jpg" alt="" />
          </div>
        </div>
      </section>
      <section class="upload">
        <div class="upload__preview">
          <div class="upload__logo">
            <svg
              xmlns="http://www.w3.org/2000/svg"
              height="54px"
              viewBox="0 -960 960 960"
              width="54px"
              fill="#4c00e5"
            >
              <path
                d="M440-320v-326L336-542l-56-58 200-200 200 200-56 58-104-104v326h-80ZM240-160q-33 0-56.5-23.5T160-240v-120h80v120h480v-120h80v120q0 33-23.5 56.5T720-160H240Z"
              />
            </svg>
          </div>
          <h3 class="upload__title">Превью Viewer</h3>
          <p class="upload__text">
            Превью Viewer — здесь будет отображаться CT-слой
          </p>
          <input
            id="zip-input"
            type="file"
            accept=".zip,image/*"
            class="upload__input"
          />
        </div>
        <div class="upload__controls">
          <button class="upload__button upload__button_start">
            <svg
              width="20"
              height="20"
              viewBox="0 0 24 31"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                d="M0.916687 30.25V27.0834H8.83335V23.9167C6.64308 23.9167 4.77606 23.1448 3.23231 21.6011C1.68856 20.0573 0.916687 18.1903 0.916687 16C0.916687 14.3903 1.3587 12.9257 2.24273 11.6063C3.12676 10.2868 4.32085 9.32363 5.82502 8.71669C6.03613 7.81946 6.50453 7.09377 7.23023 6.5396C7.95592 5.98544 8.78058 5.70835 9.70419 5.70835L8.83335 3.25419L10.3375 2.70002L9.78335 1.27502L12.7917 0.166687L13.2667 1.67085L14.7709 1.11669L19.125 12.9917L17.6209 13.5459L18.175 15.05L15.1667 16.1584L14.6917 14.6542L13.1875 15.2084L12.2375 12.5959C11.8417 12.9653 11.3865 13.2424 10.8719 13.4271C10.3573 13.6118 9.83613 13.6778 9.30835 13.625C8.7278 13.5722 8.18683 13.3941 7.68544 13.0906C7.18405 12.7872 6.74863 12.4111 6.37919 11.9625C5.66669 12.3847 5.10592 12.9521 4.6969 13.6646C4.28787 14.3771 4.08335 15.1556 4.08335 16C4.08335 17.3195 4.54516 18.441 5.46877 19.3646C6.39238 20.2882 7.51391 20.75 8.83335 20.75H21.5V23.9167H13.5834V27.0834H23.0834V30.25H0.916687ZM14.6125 12.1209L16.0375 11.5667L13.3459 4.12502L11.8417 4.67919L14.6125 12.1209ZM9.62502 11.25C10.0736 11.25 10.4497 11.0983 10.7531 10.7948C11.0566 10.4913 11.2084 10.1153 11.2084 9.66669C11.2084 9.21808 11.0566 8.84203 10.7531 8.53856C10.4497 8.23509 10.0736 8.08335 9.62502 8.08335C9.17641 8.08335 8.80037 8.23509 8.4969 8.53856C8.19342 8.84203 8.04169 9.21808 8.04169 9.66669C8.04169 10.1153 8.19342 10.4913 8.4969 10.7948C8.80037 11.0983 9.17641 11.25 9.62502 11.25Z"
                fill="#fff"
              />
            </svg>

            <span class="upload__button-text upload__button-text_white"
              >Запустить анализ</span
            >
          </button>
          <button class="upload__button upload__button_zip">
            <svg
              width="20"
              height="20"
              viewBox="0 0 19 30"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                d="M18.5 20.3125C18.5 22.768 17.6382 24.8576 15.9145 26.5812C14.1909 28.3048 12.1013 29.1666 9.64579 29.1666C7.19024 29.1666 5.10065 28.3048 3.37704 26.5812C1.65343 24.8576 0.791626 22.768 0.791626 20.3125V7.20831C0.791626 5.43748 1.41142 3.93227 2.651 2.69269C3.89058 1.4531 5.39579 0.833313 7.16663 0.833313C8.93746 0.833313 10.4427 1.4531 11.6823 2.69269C12.9218 3.93227 13.5416 5.43748 13.5416 7.20831V19.6041C13.5416 20.6903 13.1638 21.6111 12.4083 22.3666C11.6527 23.1222 10.7319 23.5 9.64579 23.5C8.55968 23.5 7.63885 23.1222 6.88329 22.3666C6.12774 21.6111 5.74996 20.6903 5.74996 19.6041V6.49998H8.58329V19.6041C8.58329 19.9111 8.68364 20.1649 8.88433 20.3656C9.08503 20.5663 9.33885 20.6666 9.64579 20.6666C9.95274 20.6666 10.2066 20.5663 10.4073 20.3656C10.6079 20.1649 10.7083 19.9111 10.7083 19.6041V7.20831C10.6847 6.21665 10.3364 5.37845 9.6635 4.69373C8.99058 4.00901 8.15829 3.66665 7.16663 3.66665C6.17496 3.66665 5.33676 4.00901 4.65204 4.69373C3.96732 5.37845 3.62496 6.21665 3.62496 7.20831V20.3125C3.60135 21.9889 4.17982 23.4114 5.36038 24.5802C6.54093 25.7489 7.9694 26.3333 9.64579 26.3333C11.2986 26.3333 12.7034 25.7489 13.8604 24.5802C15.0173 23.4114 15.6194 21.9889 15.6666 20.3125V6.49998H18.5V20.3125Z"
                fill="#202020"
              />
            </svg>
            <span class="upload__button-text">Загрузить ZIP</span>
          </button>
        </div>
      </section>
    </main>
    <footer class="footer">
      <section class="card">
        <header class="card__header">
          <div class="card__icon"></div>
          <h2 class="card__title">Помощь</h2>
        </header>

        <div class="card__content">
          <p class="card__description">
            Нужна помощь с использованием сервиса? Мы готовы ответить на ваши
            вопросы и помочь в работе с системой анализа КТ изображений.
          </p>

          <ul class="card__list">
            <li class="card__list-item">
              support@mosmedkt.ru
            </li>
            <li class="card__list-item">
              +7 (495) 123-45-67
            </li>
          </ul>
        </div>

        <div class="card__footer">
          <!--<button class="card__button">Узнать больше</button>-->
        </div>
      </section>
      <section class="card">
        <header class="card__header">
          <div class="card__icon"></div>
          <h2 class="card__title">О сервисе</h2>
        </header>

        <div class="card__content">
          <p class="card__description">
            МосМедКТ — это передовая система искусственного интеллекта для
            автоматического анализа компьютерной томографии органов грудной
            клетки.
          </p>

          <ul class="card__list">
            <li class="card__list-item">
              Высокая точность диагностики с использованием машинного обучения
            </li>
            <li class="card__list-item">
              Совместимость с форматами DICOM и ZIP архивами
            </li>
            <li class="card__list-item">
              Экспорт результатов в формате Excel для дальнейшего анализа
            </li>
          </ul>
        </div>

        <div class="card__footer">
          <!--<button class="card__button">Узнать больше</button>-->
        </div>
      </section>
    </footer>
  </div>
</template>

<style src="../public/index.css"></style>
